create table user_logs(
user_id int,
last_login date,
activity_status varchar(15)
);

insert into user_logs values (301,'2024-11-01','Active');
insert into user_logs values (302,'2024-09-25','Inactive');
insert into user_logs values (303,'2024-11-05','Active');
insert into user_logs values (304,'2024-10-01','Inactive');
insert into user_logs values (305,'2024-11-03','Active');

select * from user_logs;

+---------+------------+-----------------+
| user_id | last_login | activity_status |
+---------+------------+-----------------+
|     301 | 2024-11-01 | Active          |
|     302 | 2024-09-25 | Inactive        |
|     303 | 2024-11-05 | Active          |
|     304 | 2024-10-01 | Inactive        |
|     305 | 2024-11-03 | Active          |
+---------+------------+-----------------+

-- 17. Find all users who havenâ€™t logged in for more than 30 days from a user_logs table. 

select user_id,last_login from user_logs where last_login < date_sub('2024-11-05', interval 30 day);

+---------+------------+
| user_id | last_login |
+---------+------------+
|     302 | 2024-09-25 |
|     304 | 2024-10-01 |
+---------+------------+

create table sales(
product_id int,
product_name varchar(20),
total_sales int
);

insert into sales values(201,'Laptop',150);
insert into sales values(202,'Smartphone',300);
insert into sales values(203,'Headphones',200);
insert into sales values(204,'Monitor',100);
insert into sales values(205,'Keyboard',50);

select * from sales;

+------------+--------------+-------------+
| product_id | product_name | total_sales |
+------------+--------------+-------------+
|        201 | Laptop       |         150 |
|        202 | Smartphone   |         300 |
|        203 | Headphones   |         200 |
|        204 | Monitor      |         100 |
|        205 | Keyboard     |          50 |
+------------+--------------+-------------+

-- 18. Write a query to fetch the top 3 products with the highest sales from a sales table. 

select product_id,product_name, total_sales from sales order by total_sales desc limit 3 ;

+------------+--------------+-------------+
| product_id | product_name | total_sales |
+------------+--------------+-------------+
|        202 | Smartphone   |         300 |
|        203 | Headphones   |         200 |
|        201 | Laptop       |         150 |
+------------+--------------+-------------+

create table customers(
customer_id int,
name varchar(20),
region varchar(15)

);

insert into customers values(401,'John Doe','North');
insert into customers values(402,'Jane Smith','South');
insert into customers values(403,'Emily Johnson','East');
insert into customers values(404,'Michael Brown','West');
insert into customers values(405,'Sarah Davis','North');

select * from customers;

+-------------+---------------+--------+
| customer_id | name          | region |
+-------------+---------------+--------+
|         401 | John Doe      | North  |
|         402 | Jane Smith    | South  |
|         403 | Emily Johnson | East   |
|         404 | Michael Brown | West   |
|         405 | Sarah Davis   | North  |
+-------------+---------------+--------+

-- 19. Count the number of customers from each region in the customers table. 

select region ,Count(*) from customers group by region;

+--------+----------+
| region | Count(*) |
+--------+----------+
| North  |        2 |
| South  |        1 |
| East   |        1 |
| West   |        1 |
+--------+----------+

create table orders(
order_id int,
customer_id int,
product_id int,
order_date date,
shipped_date date,
delivery_date date
);

insert into orders values(501,401,202,'2024-10-01','2024-10-03','2024-10-05');
insert into orders values(502,402,203,'2024-11-01','2024-11-02','2024-11-04');
insert into orders values(503,403,201,'2024-10-20','2024-10-22','2024-10-21');
insert into orders values(504,401,204,'2024-10-25','2024-10-28','2024-10-27');
insert into orders values(505,405,203,'2024-11-03','2024-11-05','2024-11-06');

select * from orders;

+----------+-------------+------------+------------+--------------+---------------+
| order_id | customer_id | product_id | order_date | shipped_date | delivery_date |
+----------+-------------+------------+------------+--------------+---------------+
|      501 |         401 |        202 | 2024-10-01 | 2024-10-03   | 2024-10-05    |
|      502 |         402 |        203 | 2024-11-01 | 2024-11-02   | 2024-11-04    |
|      503 |         403 |        201 | 2024-10-20 | 2024-10-22   | 2024-10-21    |
|      504 |         401 |        204 | 2024-10-25 | 2024-10-28   | 2024-10-27    |
|      505 |         405 |        203 | 2024-11-03 | 2024-11-05   | 2024-11-06    |
+----------+-------------+------------+------------+--------------+---------------+

-- 20. Retrieve all orders from the orders table where the shipped_date is later than the delivery_date. 

select * from orders where shipped_date > delivery_date;

+----------+-------------+------------+------------+--------------+---------------+
| order_id | customer_id | product_id | order_date | shipped_date | delivery_date |
+----------+-------------+------------+------------+--------------+---------------+
|      503 |         403 |        201 | 2024-10-20 | 2024-10-22   | 2024-10-21    |
|      504 |         401 |        204 | 2024-10-25 | 2024-10-28   | 2024-10-27    |
+----------+-------------+------------+------------+--------------+---------------+

create table employees(
employee_id int,
name varchar(20),
age int,
department varchar(10),
salary int,
email varchar(30),
years_at_company int
);

insert into employees values(101,'Alice',25,'IT',50000,'alice@gmail.com',2);
insert into employees values(102,'Bob',35,'HR',40000,'bob@yahoo.com',6);
insert into employees values(103,'Charlie',30,'Finance',55000,'',4);
insert into employees values(104,'Diana',40,'IT',70000,'diana@gmail.com',10);
insert into employees values(105,'Evan',29,'Sales',45000,'evan@outlook.com',3);
insert into employees values(106,'Fiona',22,'IT',65000,'fiona@gmail.com',1);
insert into employees values(107,'George',45,'Marketing',48000,'george@gmail.com',12);
insert into employees values(108,'Hannah',28,'HR',47000,'hannah@yahoo.com',5);

select * from employees;

+-------------+---------+------+------------+--------+------------------+------------------+
| employee_id | name    | age  | department | salary | email            | years_at_company |
+-------------+---------+------+------------+--------+------------------+------------------+
|         101 | Alice   |   25 | IT         |  50000 | alice@gmail.com  |                2 |
|         102 | Bob     |   35 | HR         |  40000 | bob@yahoo.com    |                6 |
|         103 | Charlie |   30 | Finance    |  55000 |                  |                4 |
|         104 | Diana   |   40 | IT         |  70000 | diana@gmail.com  |               10 |
|         105 | Evan    |   29 | Sales      |  45000 | evan@outlook.com |                3 |
|         106 | Fiona   |   22 | IT         |  65000 | fiona@gmail.com  |                1 |
|         107 | George  |   45 | Marketing  |  48000 | george@gmail.com |               12 |
|         108 | Hannah  |   28 | HR         |  47000 | hannah@yahoo.com |                5 |
+-------------+---------+------+------------+--------+------------------+------------------+

21. Sort by Multiple Columns: 
Retrieve employees sorted by department in ascending order and salary in descending order.

select * from employees order by department;

select * from employees order by salary desc;

+-------------+---------+------+------------+--------+------------------+------------------+
| employee_id | name    | age  | department | salary | email            | years_at_company |
+-------------+---------+------+------------+--------+------------------+------------------+
|         103 | Charlie |   30 | Finance    |  55000 |                  |                4 |
|         102 | Bob     |   35 | HR         |  40000 | bob@yahoo.com    |                6 |
|         108 | Hannah  |   28 | HR         |  47000 | hannah@yahoo.com |                5 |
|         101 | Alice   |   25 | IT         |  50000 | alice@gmail.com  |                2 |
|         104 | Diana   |   40 | IT         |  70000 | diana@gmail.com  |               10 |
|         106 | Fiona   |   22 | IT         |  65000 | fiona@gmail.com  |                1 |
|         107 | George  |   45 | Marketing  |  48000 | george@gmail.com |               12 |
|         105 | Evan    |   29 | Sales      |  45000 | evan@outlook.com |                3 |
+-------------+---------+------+------------+--------+------------------+------------------+

+-------------+---------+------+------------+--------+------------------+------------------+
| employee_id | name    | age  | department | salary | email            | years_at_company |
+-------------+---------+------+------------+--------+------------------+------------------+
|         104 | Diana   |   40 | IT         |  70000 | diana@gmail.com  |               10 |
|         106 | Fiona   |   22 | IT         |  65000 | fiona@gmail.com  |                1 |
|         103 | Charlie |   30 | Finance    |  55000 |                  |                4 |
|         101 | Alice   |   25 | IT         |  50000 | alice@gmail.com  |                2 |
|         107 | George  |   45 | Marketing  |  48000 | george@gmail.com |               12 |
|         108 | Hannah  |   28 | HR         |  47000 | hannah@yahoo.com |                5 |
|         105 | Evan    |   29 | Sales      |  45000 | evan@outlook.com |                3 |
|         102 | Bob     |   35 | HR         |  40000 | bob@yahoo.com    |                6 |
+-------------+---------+------+------------+--------+------------------+------------------+

-- 22. Fetch the highest-paid employee from each department.

select department,max(salary) as maximum_salary from employees group by department;

+------------+----------------+
| department | maximum_salary |
+------------+----------------+
| IT         |          70000 |
| HR         |          47000 |
| Finance    |          55000 |
| Sales      |          45000 |
| Marketing  |          48000 |
+------------+----------------+


-- 23. Find all employees whose email addresses are NULL. 

select * from employees where email =null;

-- 24. Update the salary to 30000 for all employees whose current salary is NULL.

Update employees set salary =30000 where salary isnull

25. Count how many users are active and inactive from the user_activity table. 

select Count(*) from user_logs where activity_status='Active'

select Count(*) from user_logs where activity_status='Inactive'

-----------
          3
           
-----------
          2

26. Identify the customer who 1has made the most purchases.

select customer_id, count(*) as total_purchases from orders 

  group by customer_id order by total_purchases desc limit 1;

+-------------+-----------------+
| customer_id | total_purchases |
+-------------+-----------------+
|         401 |               2 |
+-------------+-----------------+

27. Find the product that has been purchased most frequently.

select product_id, count(*) as total_products from orders 

  group by product_id order by total_products desc limit 1;

+------------+----------------+
| product_id | total_products |
+------------+----------------+
|        203 |              2 |
+------------+----------------+

28. Assign a rank to each employee based on their salary in descending order.

select employee_id,name,department,salary,rank() over (order by salary desc) as rank 
  from employees;

EMPLOYEE_ID NAME	DEPARTMENT	    SALARY	     RANK
----------- -------------------- ---------- ---------- 
	104     Diana		 IT		        70000		1
	106     Fiona		 IT		        65000		2
	103     Charlie		 Finance	    55000		3
	101     Alice		 IT		        50000		4
	107     George		 Marketing	    48000		5
	108     Hannah		 HR		        47000		6
	105     Evan		 Sales		    45000		7
	102     Bob 		 HR		        40000		8

29. Retrieve duplicate records from the orders table based on the customer_id and 
order_date.

select customer_id,order_id, count(*) as duplicate_count from orders
  group by customer_id,order_id having count(*)>1;